Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils.GetStructuralSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Return structural section from element.
Remarks:
Only beams, braces and structural columns can have structural section associated with it.
document:
The document that owns the family for beam, brace or structural column.
familySymbolId:
ID of family symbol for beam, brace or structural column.
Returns:
Structural section returned if element have one.
For elements that do not have structural section or can not have structural section null will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015